Repository: Sibaath/SIH_2025_Digital_Farm_Management_Portal
Catalog: frontend/lib/l10n/app_*.arb
Languages: ta

# loginTitle
source: Login
ta: உள்நுழைய

# signInMessage
source: Sign In to your Account
ta: உங்கள் கணக்கில் உள்நுழையவும்

source: Username
ta: பயனர் பெயர்

source: Password
ta: கடவுச்சொல்

# loginButton
source: Login
ta: உள்நுழைய

# emptyFields
source: Please enter a username and password
ta: தயவுசெய்து பயனர் பெயர் மற்றும் கடவுச்சொல்லை உள்ளிடவும்

# welcomeTitle
source: Welcome to AgriGuard
ta: அக்ரிகார்டுக்கு வரவேற்கிறோம்

# welcomeSubtitle
source: Your partner in farm biosecurity and health management.
ta: பண்ணை உயிரியல் பாதுகாப்பு மற்றும் சுகாதார மேலாண்மையில் உங்கள் துணை.

source: Login
ta: உள்நுழைய

source: Sign Up
ta: சைன் அப்

# loadingMessage
source: Loading, please wait...
ta: लोड हो रहा है, कृपया प्रतीक्षा करें...

source: Welcome, Farmer!
ta: வாருங்கள், விவசாயி!

# farmAtGlance
source: Here's a snapshot of your farm.
ta: உங்கள் பண்ணையின் ஓரளவு பார்வை.

source: Farm Compartments
ta: பண்ணை பிரிவுகள்

source: Key Statistics
ta: முக்கிய புள்ளிவிவரங்கள்

source: Quick Actions
ta: விரைவு செயல்கள்

source: Add New
ta: புதியதைச் சேர்க்கவும்

source: Add New Compartment
ta: புதிய பிரிவைச் சேர்க்கவும்

source: Upload Medical Report
ta: மருத்துவ அறிக்கையை பதிவேற்றவும்

source: Animal Type
ta: விலங்கு வகை

source: Male Count
ta: ஆண் எண்ணிக்கை

source: Female Count
ta: பெண் எண்ணிக்கை

source: Note
ta: குறிப்பு

source: Cancel
ta: ரத்து செய்

source: Add
ta: சேர்க்க

# compartmentAdded
source: Compartment added successfully!
ta: பிரிவு வெற்றிகரமாக சேர்க்கப்பட்டது!

source: No file selected
ta: எந்தக் கோப்பும் தேர்ந்தெடுக்கப்படவில்லை

source: Medical Report Submitted
ta: மருத்துவ அறிக்கை சமர்ப்பிக்கப்பட்டது

# fileLabel
source: File
ta: கோப்பு

source: Analyzing report...
ta: அறிக்கையை பகுப்பாய்வு செய்கிறது...

source: AI Analysis Complete
ta: ஏ.ஐ. பகுப்பாய்வு முடிந்தது

source: Report Name
ta: அறிக்கையின் பெயர்

source: AI Summary
ta: ஏ.ஐ. சுருக்கம்

source: Done
ta: முடிந்தது

source: Compartment Details
ta: பிரிவு விவரங்கள்

source: Likely Infected
ta: தொற்றாகக் கொள்ளும் சாத்தியம்

source: Low
ta: குறைந்தது

source: Needs Treatment
ta: சிகிச்சை தேவை

source: No
ta: இல்லை

source: Compartment Health
ta: பிரிவு ஆரோக்கியம்

source: Stable
ta: நிலையானது

source: Biosecurity Score
ta: உயிர் பாதுகாப்பு மதிப்பெண்

source: Close
ta: மூடு

source: Health Score
ta: ஆரோக்கிய மதிப்பெண்

# healthScoreDescription
source: Overall health score based on AI analysis.
ta: ஏ.ஐ. பகுப்பாய்வின் அடிப்படையில் மொத்த ஆரோக்கிய மதிப்பெண்.

source: Daily Scans Completed
ta: தினசரி ஸ்கேன் முடிந்தது

source: days
ta: நாட்கள்

source: Total Animals
ta: மொத்த விலங்குகள்

source: Daily Scan
ta: தினசரி ஸ்கேன்

source: Contacts
ta: தொடர்பு

source: Settings
ta: அமைப்புகள்

source: Settings clicked
ta: அமைப்புகள் அழுத்தப்பட்டது

source: View Details
ta: விவரங்களைப் பார்க்க

source: Male
ta: ஆண்

source: Female
ta: பெண்

# noteLabel
source: Note
ta: குறிப்பு

# signUpTitle
source: Sign Up
ta: பதிவு

# createNewAccount
source: Create a new Account
ta: புதிய கணக்கை உருவாக்கவும்

source: Full Name
ta: முழுப் பெயர்

# enterName
source: Please enter your name
ta: தயவுசெய்து உங்கள் பெயரை உள்ளிடவும்

source: Phone Number
ta: தொலைபேசி எண்

# enterPhone
source: Please enter your phone number
ta: தயவுசெய்து உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்

source: Email
ta: மின்னஞ்சல்

# enterValidEmail
source: Please enter a valid email
ta: தயவுசெய்து செல்லுபடியாகும் மின்னஞ்சலை உள்ளிடவும்

# passwordMin6
source: Password must be at least 6 characters
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்

source: Location
ta: இடம்

# getLocation
source: Please get your location
ta: தயவுசெய்து உங்கள் இடத்தை பெறவும்

# locationFetched
source: Location fetched successfully!
ta: இடம் வெற்றிகரமாக பெறப்பட்டது!

# signUpButton
source: Sign Up
ta: பதிவு செய்யவும்

# fillRequiredFields
source: Please fill all the required fields
ta: அனைத்து தேவையான புலங்களையும் நிரப்பவும்

source: Veterinarians Nearby
ta: அருகிலுள்ள வேட்டியர்கள்

source: Booked Appointments
ta: முன்பதிவு செய்யப்பட்ட நியமனங்கள்

# doctorJohnDoe
source: Dr. John Doe
ta: டாக்டர் ஜான் டோ

# doctorJaneSmith
source: Dr. Jane Smith
ta: டாக்டர் ஜேன் ஸ்மித்

# doctorEmilyWhite
source: Dr. Emily White
ta: டாக்டர் எமிலி வைட்

# avianExpert
source: Avian Biosecurity Expert
ta: பறவை உயிரியல் பாதுகாப்பு நிபுணர்

# swineSpecialist
source: Swine Health Specialist
ta: சூட் விலங்கு நிபுணர்

# generalVeterinary
source: General Veterinary Care
ta: பொதுவான விலங்கு மருத்துவ சேவை

source: Madurai
ta: மதுரை

source: Coimbatore
ta: கோயம்புத்தூர்

source: Trichy
ta: திருச்சி

source: Book Appointment with
ta: முகாமை முன்பதிவு செய்யவும்

source: Select Date & Time
ta: தேதி மற்றும் நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Medical Documents
ta: மருத்துவ ஆவணங்கள்

# attachMedicalReport
source: Attach Medical Report (PDF)
ta: மருத்துவ அறிக்கை இணைக்கவும் (PDF)

source: Medical report attached!
ta: மருத்துவ அறிக்கை இணைக்கப்பட்டது!

source: View Animal Health Summary
ta: மிருகத்தின் ஆரோக்கியச் சுருக்கத்தைப் பார்க்கவும்

source: Animal Health Summary
ta: மிருக ஆரோக்கியச் சுருக்கம்

# animalHealthSummaryContent
source: Summary of the animal health based on recent scans will appear here.
ta: சமீபத்திய ஸ்கேன் அடிப்படையில் மிருக ஆரோக்கியத்தின் சுருக்கம் இங்கு தோன்றும்.

source: Book Appointment
ta: முகாமை முன்பதிவு செய்யவும்

source: Date
ta: தேதி

# appointmentBooked
source: Appointment booked successfully!
ta: நியமிக்கப்பட்ட சந்திப்பு வெற்றி!
